sugarcrm-connector-test/src/test/resources/artifacts/ESB/config/soapRequests/sugarcrm/createCase.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:sug="wso2.connector.sugarcrm.createcase">
   <soapenv:Header/>
   <soapenv:Body>
      <sug:appUri>https://ancexg1011.trial.sugarcrm.com/soap.php</sug:appUri>
      <sug:userName>admin</sug:userName>
      <sug:password>7967FC557FBC88C8FD0C2A74E1B86C49</sug:password>
      <sug:name>testcase</sug:name>
   </soapenv:Body>
</soapenv:Envelope>